## Problem 1). <font color=darkblue >Prepare a classification model using Naive Bayes for Salary data.<font/>

## <font color=blue>Step 1.<font/>

### <font color=red>Bussiness objective:-<font/> <font color=black>To perfectly classify the Salary data by building efficient model with best accuracay.<font/>

### <font color=red>Bussiness contraints:- <font/> <font color=black>Minimize the model error percentage.<font/>

## <font color=blue>Step 2.<font/>

### <font color=red>Data Understanding and Analysis<font/>

In [ ]:
# Importing all the necessary Libraries

import pandas as pd               # for Data Manipulation
import matplotlib.pyplot as plt   # for Visualization
import numpy as np                # for Mathematical calculations
import seaborn as sns             # for Advanced visualizations

from sklearn.feature_extraction.text import CountVectorizer, TfidfTransformer

In [ ]:
# Loading the Salary Dataset

sal_train = pd.read_csv("SalaryData_Train.csv", encoding = "ISO-8859-1")
sal_test = pd.read_csv("SalaryData_Test.csv", encoding = "ISO-8859-1")

In [ ]:
# To see top five observations of salary train data.
sal_train.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,39,State-gov,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [ ]:
# To see top five observations of salary test data.
sal_test.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,25,Private,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,34,Private,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K

### Exploratory data analysis:

In [ ]:
# To know the descriptive statistical information and distribution of the Data.

sal_train.describe()

                age   educationno   capitalgain   capitalloss  hoursperweek
count  30161.000000  30161.000000  30161.000000  30161.000000  30161.000000
mean      38.438115     10.121316   1092.044064     88.302311     40.931269
std       13.134830      2.550037   7406.466611    404.121321     11.980182
min       17.000000      1.000000      0.000000      0.000000      1.000000
25%       28.000000      9.000000      0.000000      0.000000     40.000000
50%       37.000000     10.000000      0.000000      0.000000     40.000000
75%       47.000000     13.000000      0.000000      0.000000     45.000000
max       90.000000     16.000000  99999.000000   4356.000000     99.000000

In [ ]:
# To know the descriptive statistical information and distribution of the Data.
sal_test.describe()

                age   educationno   capitalgain   capitalloss  hoursperweek
count  15060.000000  15060.000000  15060.000000  15060.000000  15060.000000
mean      38.768327     10.112749   1120.301594     89.041899     40.951594
std       13.380676      2.558727   7703.181842    406.283245     12.062831
min       17.000000      1.000000      0.000000      0.000000      1.000000
25%       28.000000      9.000000      0.000000      0.000000     40.000000
50%       37.000000     10.000000      0.000000      0.000000     40.000000
75%       48.000000     13.000000      0.000000      0.000000     45.000000
max       90.000000     16.000000  99999.000000   3770.000000     99.000000

In [ ]:
# Check for the Null values.
sal_train.isnull().sum()

age              0
workclass        0
education        0
educationno      0
maritalstatus    0
occupation       0
relationship     0
race             0
sex              0
capitalgain      0
capitalloss      0
hoursperweek     0
native           0
Salary           0
dtype: int64

In [ ]:
# Check for the Null values.
sal_test.isnull().sum()

age              0
workclass        0
education        0
educationno      0
maritalstatus    0
occupation       0
relationship     0
race             0
sex              0
capitalgain      0
capitalloss      0
hoursperweek     0
native           0
Salary           0
dtype: int64

In [ ]:
sal_train.workclass.value_counts()

 Private             22285
 Self-emp-not-inc     2499
 Local-gov            2067
 State-gov            1279
 Self-emp-inc         1074
 Federal-gov           943
 Without-pay            14
Name: workclass, dtype: int64

In [ ]:
sal_test.workclass.value_counts()

 Private             11021
 Self-emp-not-inc     1297
 Local-gov            1033
 State-gov             667
 Self-emp-inc          572
 Federal-gov           463
 Without-pay             7
Name: workclass, dtype: int64

In [ ]:
# To see the data types
sal_train.dtypes

age               int64
workclass        object
education        object
educationno       int64
maritalstatus    object
occupation       object
relationship     object
race             object
sex              object
capitalgain       int64
capitalloss       int64
hoursperweek      int64
native           object
Salary           object
dtype: object

In [ ]:
# To see the preview of the data.
sal_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30161 entries, 0 to 30160
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            30161 non-null  int64
 1   workclass      30161 non-null  object
 2   education      30161 non-null  object
 3   educationno    30161 non-null  int64
 4   maritalstatus  30161 non-null  object
 5   occupation     30161 non-null  object
 6   relationship   30161 non-null  object
 7   race           30161 non-null  object
 8   sex            30161 non-null  object
 9   capitalgain    30161 non-null  int64
 10  capitalloss    30161 non-null  int64
 11  hoursperweek   30161 non-null  int64
 12  native         30161 non-null  object
 13  Salary         30161 non-null  object
dtypes: int64(5), object(9)
memory usage: 3.2+ MB

## <font color=blue>Step 3.<font/>

### <font color=red>Data Pre-Cleansing or Data Preparation:<font/>

In [ ]:
# To know the columns name of the data
sal_train.columns

Index(['age', 'workclass', 'education', 'educationno', 'maritalstatus',
       'occupation', 'relationship', 'race', 'sex', 'capitalgain',
       'capitalloss', 'hoursperweek', 'native', 'Salary'],
      dtype='object')

In [ ]:
# Declare feature vector and target variable

x_train = sal_train.drop(['Salary'], axis=1)
y_train = sal_train['Salary']

x_test = sal_test.drop(['Salary'], axis=1)
y_test = sal_test['Salary']

In [ ]:
# Encoding categorical variable(s) with one-hot encoding.

# !pip install category_encoders

import category_encoders as ce

encoders = ce.OneHotEncoder(cols=['workclass', 'education', 'maritalstatus', 'occupation', 'relationship', 'race', 'sex', 'native'])

x_train = encoders.fit_transform(x_train)
x_test = encoders.fit_transform(x_test)

In [ ]:
x_train.head()

,age,workclass_1,workclass_2,workclass_3,workclass_4,workclass_5,workclass_6,workclass_7,education_1,education_2,...,native_31,native_32,native_33,native_34,native_35,native_36,native_37,native_38,native_39,native_40
0,39,1,0,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
1,50,0,1,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
2,38,0,0,1,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
3,53,0,0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,28,0,0,1,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0

In [ ]:
# To check the size of the dataset
x_train.shape

(30161, 102)

In [ ]:
x_test.head()

,age,workclass_1,workclass_2,workclass_3,workclass_4,workclass_5,workclass_6,workclass_7,education_1,education_2,...,native_31,native_32,native_33,native_34,native_35,native_36,native_37,native_38,native_39,native_40
0,25,1,0,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
1,38,1,0,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
2,28,0,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,44,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,34,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [ ]:
# To check the size of the dataset
x_test.shape

(15060, 102)

In [ ]:
# Converting Salary column in Training data into binary as (' <=50K' : 1) and (' >=50K' : 1).
y_train = pd.get_dummies(y_train)
y_train = y_train.drop(' <=50K', axis=1)
y_train = y_train.rename(columns={" >50K":"Salary"}) 
y_train.head()

   Salary
0       0
1       0
2       0
3       0
4       0

In [ ]:
# Converting Salary column in Test data into binary as (' <=50K' : 1) and (' >=50K' : 1).
y_test = pd.get_dummies(y_test)
y_test = y_test.drop(' <=50K', axis=1)
y_test = y_test.rename(columns={" >50K":"Salary"})
y_test.head()

   Salary
0       0
1       0
2       1
3       1
4       0

## <font color=blue>Step 4.<font/>

### <font color=red>Model Building - NaiveBayes<font/>

In [ ]:
# By using Multinomial Naive Bayes 
from sklearn.naive_bayes import MultinomialNB

############  Multinomial Naive Bayes  ###############
classifier_mb = MultinomialNB()   # Define the model with default parameters

classifier_mb.fit(x_train, y_train)

C:\Users\user\anaconda3\lib\site-packages\sklearn\utils\validation.py:73: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

MultinomialNB()

## <font color=blue>Step 5.<font/>

### <font color=red>Model Evaluation - Multinomial NaiveBayes<font/>

In [ ]:
########### Evalution on Training Data ##################
train_pred_m = classifier_mb.predict(x_train)
accuracy_train_m = np.mean(train_pred_m == y_train.Salary)
accuracy_train_m

0.7729186698053778

In [ ]:
############# Evaluation on Test Data #################
test_pred_m = classifier_mb.predict(x_test)
accuracy_test_m = np.mean(test_pred_m == y_test.Salary)
accuracy_test_m

0.7749667994687915

In [ ]:
# Method 2 for calculating accuracy
from sklearn.metrics import accuracy_score
accuracy_score(test_pred_m, y_test.Salary)

0.7749667994687915

In [ ]:
# Confusion Matrix to evaluate the prediction results
pd.crosstab(test_pred_m, y_test.Salary)

Salary      0     1
row_0
0       10891  2920
1         469   780

## <font color=blue>Step 6.<font/>

### <font color=red>Model Tunning using Laplace Smoothing<font/>

In [ ]:
############ Naive Bayes with Laplace Smoothing ###############
classifier_mb_lap = MultinomialNB(alpha = 0.25)   # Define the model with default parameters

classifier_mb_lap.fit(x_train, y_train)

In [ ]:
########### Evalution on Training Data ##################
train_pred_m = classifier_mb_lap.predict(x_train)
accuracy_train_m = np.mean(train_pred_m == y_train.Salary)
accuracy_train_m

In [ ]:
############# Evaluation on Test Data #################
test_pred_m = classifier_mb_lap.predict(x_test)
accuracy_test_m = np.mean(test_pred_m == y_test.Salary)
accuracy_test_m

In [ ]:
# Confusion Matrix to evaluate the prediction results
pd.crosstab(test_pred_m, y_test.Salary)

## <font color=blue> By using Gaussian Naive Bayes, model preparation

## <font color=blue>Step 4.<font/>

### <font color=red>Model Building - Gaussian Naive Bayes<font/>

In [ ]:

from sklearn.naive_bayes import GaussianNB

##  initiate the model and fit the model.
gnb = GaussianNB()

gnb.fit(x_train,y_train)

C:\Users\user\anaconda3\lib\site-packages\sklearn\utils\validation.py:73: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

GaussianNB()

## <font color=blue>Step 5.<font/>

### <font color=red>Model Evaluation - Gaussian Naive Bayes<font/>

In [ ]:
####### Training Phase ##########
# Predict the Result
y_pred = gnb.predict(x_train)
y_pred

0.8031563940187659

In [ ]:
# Check accuracy score
accuracy_score(y_train, y_pred)

In [ ]:
####### Testing Phase #########
# Predict the results
y_pred = gnb.predict(x_test)
y_pred

0.7719123505976095

In [ ]:
# Check accuracy score
from sklearn.metrics import accuracy_score
accuracy_score(y_test, y_pred)